# NoWireMaterialDensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..NoWireMaterialDensity Property
BuiltInFailures..::..FabricFailures Class See Also
---
Material does not have a density defined. The weight of the Fabric Sheet cannot be computed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoWireMaterialDensity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoWireMaterialDensity As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoWireMaterialDensity {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace